\[
{
"title":"Stacks : What is it?",
"preDescription":null,
"note":null,
"mainDescription":["It is an important Datastructure. Each of the developer in this universe would have heard of a stacktrace(If not , well you just did). Well why is it calledEach of the developer in this universe would have heard of a stacktraceEach of the developer in this universe would have heard of a stacktraceEach of the developer in this universe would have heard of a stacktraceEach of the developer in this universe would have heard of a stacktraceEach of the developer in this universe would have heard of a stacktraceEach of the developer in this universe would have heard of a stacktraceEach of the developer in this universe would have heard of a stacktraceEach of the developer in this universe would have heard of a stacktraceEach of the developer in this universe would have heard of a stacktraceEach of the developer in this universe would have heard of a stacktraceEach of the developer in this universe would have heard of a stacktraceEach of the developer in this universe would have heard of a stacktraceEach of the developer in this universe would have heard of a stacktrace",
"universe would have heard of a stacktrace(If not , well you just did). Well why is it called",
"a stack trace? that is because the it shows to the trace from the most recent exception all the way back to the origin."],
"image":"java9.jpg",
"code":["a+b * c"," var c = new pb();","c.alksd() { system.out.println}"],
"postDescription":[]
},
{
"title":"Stack Usages",
"preDescription":null,
"note":null,
"mainDescription":["Consider a normal day where you are going to wake up at 6" ,
"hit the gym at 630, get the kids to school at 8, go to office at 9.All this is",
"planned and place in your brain or a calender as a stack which you keep checking out as you go in order.",
"Well the same use is the stacks in the real world.You keep the priority items on top of the stack and keep on working out till the stack is empty."],
"image":null,
"code":null,
"postDescription":null
},
{
"title":"Implementations",
"preDescription":null,
"note":null,
"mainDescription":["Stacks can be implemented in 3 ways :",
"1.Using Simple Arrays","2.using Dynamic Arrays","3.Using Linked Lists"],
"image":null,
"code":null,
"postDescription":null
}
]